package com.zjzmjr.core.enums.message;

/**
 * 短信模版
 * 
 * @author Administrator
 * @version $Id: NotifyContextEnum.java, v 0.1 2017-12-28 上午9:28:17 Administrator Exp $
 */
public enum NotifyContextEnum {

    applyDeadline("报名截止消息", "项目【{name}】即将于{date}报名截止，请注意！", "", "SMS_113450212"),
    bidDeadline("招标报名截止消息", "项目【{name}】即将于{date}招标报名截止，请注意！", "", "SMS_113450212"),
    marginDeadline("保证金截止消息", "项目【{name}】即将于{date}保证金截止，请注意！", "", "SMS_113450212"),
    tenderDeadline("投标截止消息", "项目【{name}】即将于{date}投标截止，请注意！", "", "SMS_113450212"),
    projectInput("项目信息已录入", "项目【{name}】:项目信息已录入，请确定是否立项", "", "SMS_112485213"),
    recommendLeader("您已被推荐为技术负责人","项目【{name}】:您已被推荐为技术负责人，请在截止日期{date}前提供项目计划", "", "SMS_112470159"),
    inviteLeader("您已被邀请为技术负责人", "项目【{name}】:您已被邀请为技术负责人，请在截止日期{date}前提供项目计划", "", "SMS_112470159"),
    Msg_30("已收到项目计划","项目【{name}】:{leader}已提供项目计划，请关注", "", "SMS_112485230"),
    Msg_40("您已被确认为负责人","项目【{name}】:恭喜您，您已被院办确认为本项目的负责人", "", "SMS_112475258"),
    Msg_50("项目立项成功","项目【{name}】:项目立项成功，请录入招标公告", "", "SMS_112475204"),
    Msg_60("项目立项成功","项目【{name}】:项目立项成功，请上传合同拟定版", "", "SMS_112475204"),
    Msg_70("报名文件拟定已上传","项目【{name}】:报名文件拟定已上传，请审核", "", "SMS_112465371"),
    Msg_80("报名文件拟定已上传","项目【{name}】:报名文件拟定已上传，请审核", "", "SMS_112465371"),
    Msg_90("报名文件拟定经营审核已通过","项目【{name}】:报名文件拟定经营审核已通过", "", "SMS_112470612"),
    Msg_100("报名文件拟定经营审核不通过","项目【{name}】:报名文件拟定经营审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_110("报名文件拟定审核已通过","项目【{name}】:报名文件拟定审核已通过，请盖章", "", "SMS_112465213"),
    Msg_120("报名文件拟定技术审核已通过","项目【{name}】:报名文件拟定技术审核已通过", "", "SMS_112470612"),
    Msg_130("报名文件拟定技术审核不通过","项目【{name}】:报名文件拟定技术审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_140("报名文件已盖章","项目【{name}】:报名文件已盖章，请上传", "", "SMS_112470154"),
    Msg_150("招标文件已上传","项目【{name}】:招标文件已上传，请上传技术标拟定", "", "SMS_112475167"),
    Msg_160("保证金已申请","项目【{name}】:保证金已申请，请审核", "", "SMS_112465373"),
    Msg_170("保证金已申请","项目【{name}】:保证金已申请，请审核", "", "SMS_112465373"),
    Msg_180("保证金申请经营审核已通过","项目【{name}】:保证金申请经营审核已通过", "", "SMS_112465489"),
    Msg_190("保证金申请经营审核不通过","项目【{name}】:保证金申请经营审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_200("保证金已申请","项目【{name}】:保证金已申请，请审核", "", "SMS_112465373"),
    Msg_210("保证金申请技术审核已通过","项目【{name}】:保证金申请技术审核已通过", "", "SMS_112465489"),
    Msg_220("保证金申请技术审核不通过","项目【{name}】:保证金申请技术审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_230("保证金已申请","项目【{name}】:保证金已申请，请审核", "", "SMS_112465373"),
    Msg_240("保证金申请财务审核已通过","项目【{name}】:保证金申请财务审核已通过", "", "SMS_112465489"),
    Msg_250("保证金申请财务审核不通过","项目【{name}】:保证金申请财务审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_260("保证金申请审核已通过","项目【{name}】:保证金申请审核已通过，请打款", "", "SMS_112465489"),
    Msg_270("保证金申请院办审核已通过","项目【{name}】:保证金申请院办审核已通过", "", "SMS_112465489"),
    Msg_280("保证金申请院办审核不通过","项目【{name}】:保证金申请院办审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_290("保证金打款已完成","项目【{name}】:保证金打款已完成，金额:{money}万元", "", "SMS_112465155"),
    Msg_300("保证金打款已完成","项目【{name}】:保证金打款已完成，金额:{money}万元", "", "SMS_112465155"),
    Msg_310("商务标拟定已上传","项目【{name}】:商务标拟定已上传，请审核", "", "SMS_112465371"),
    Msg_320("商务标拟定已上传","项目【{name}】:商务标拟定已上传，请审核", "", "SMS_112465371"),
    Msg_330("商务标拟定经营审核已通过","项目【{name}】:商务标拟定经营审核已通过", "", "SMS_112465489"),
    Msg_340("商务标拟定经营审核不通过","项目【{name}】:商务标拟定经营审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_350("商务标拟定已上传","项目【{name}】:商务标拟定已上传，请审核", "", "SMS_112465371"),
    Msg_360("商务标拟定审核已通过","项目【{name}】:商务标拟定审核已通过，请盖章", "", "SMS_112465213"),
    Msg_370("商务标拟定技术审核已通过","项目【{name}】:商务标拟定技术审核已通过", "", "SMS_112465489"),
    Msg_380("商务标拟定技术审核不通过","项目【{name}】:商务标拟定技术审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_390("商务标拟定审核已通过","项目【{name}】:商务标拟定审核已通过，请盖章", "", "SMS_112465213"),
    Msg_400("商务标拟定院办审核已通过","项目【{name}】:商务标拟定院办审核已通过", "", "SMS_112465489"),
    Msg_410("商务标拟定院办审核不通过","项目【{name}】:商务标拟定院办审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_420("商务标已盖章","项目【{name}】:商务标已盖章，请上传", "", "SMS_112470154"),
    Msg_430("技术标拟定已上传","项目【{name}】:技术标拟定已上传，请审核", "", "SMS_112465371"),
    Msg_440("技术标拟定已上传","项目【{name}】:技术标拟定已上传，请审核", "", "SMS_112465371"),
    Msg_450("技术标拟定审核已通过","项目【{name}】:技术标拟定审核已通过，请盖章", "", "SMS_112465213"),
    Msg_460("技术标拟定总工审核已通过","项目【{name}】:技术标拟定总工审核已通过", "", "SMS_112465489"),
    Msg_470("技术标拟定总工审核不通过","项目【{name}】:技术标拟定总工审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_480("技术标拟定审核已通过","项目【{name}】:技术标拟定审核已通过，请盖章", "", "SMS_112465213"),
    Msg_490("技术标拟定院办审核已通过","项目【{name}】:技术标拟定院办审核已通过", "", "SMS_112465489"),
    Msg_500("技术标拟定院办审核不通过","项目【{name}】:技术标拟定院办审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_510("技术标已盖章","项目【{name}】:技术标已盖章，请上传", "", "SMS_112470154"),
    Msg_520("合同拟定已上传","项目【{name}】:合同拟定已上传，请审核", "", "SMS_112465371"),
    Msg_530("合同拟定已上传","项目【{name}】:合同拟定已上传，请审核", "", "SMS_112465371"),
    Msg_540("合同拟定已上传","项目【{name}】:合同拟定已上传，请审核", "", "SMS_112465371"),
    Msg_550("合同拟定经营审核已通过","项目【{name}】:合同拟定经营审核已通过", "", "SMS_112465489"),
    Msg_560("合同拟定经营审核不通过","项目【{name}】:合同拟定经营审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_570("合同拟定已上传","项目【{name}】:合同拟定已上传，请审核", "", "SMS_112465371"),
    Msg_580("合同拟定经营审核已通过","项目【{name}】:合同拟定总工审核已通过", "", "SMS_112465489"),
    Msg_590("合同拟定经营审核不通过","项目【{name}】:合同拟定经营审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_600("合同拟定已申请","项目【{name}】:合同拟定已上传，请审核", "", "SMS_112465371"),
    Msg_610("合同拟定技术审核已通过","项目【{name}】:合同拟定技术审核已通过", "", "SMS_112465489"),
    Msg_620("合同拟定技术审核不通过","项目【{name}】:合同拟定技术审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_630("合同拟定已申请","项目【{name}】:合同拟定已申请，请审核", "", "SMS_112465373"),
    Msg_640("合同拟定财务审核已通过","项目【{name}】:合同拟定财务审核已通过", "", "SMS_112465489"),
    Msg_650("合同拟定财务审核不通过","项目【{name}】:合同拟定财务审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_660("合同拟定已申请","项目【{name}】:合同拟定已申请，请审核", "", "SMS_112465373"),
    Msg_670("合同拟定法务审核已通过","项目【{name}】:合同拟定法务审核已通过", "", "SMS_112465489"),
    Msg_680("合同拟定法务审核不通过","项目【{name}】:合同拟定法务审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_690("合同拟定审核已通过","项目【{name}】:合同拟定审核已通过，请盖章", "", "SMS_112465213"),
    Msg_700("合同拟定院办审核已通过","项目【{name}】:合同拟定院办审核已通过", "", "SMS_112470612"),
    Msg_710("合同拟定院办审核不通过","项目【{name}】:合同拟定院办审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_720("合同已盖章","项目【{name}】:合同已盖章，请上传", "", "SMS_112470154"),
    Msg_730("设置合作比例","项目【{name}】:请设置合作比例", "", "SMS_112485214"),
    Msg_740("合作比例拟定已申请","项目【{name}】:合作比例拟定已申请，请审核", "", "SMS_112465373"),
    Msg_750("合作比例拟定院办审核已通过","项目【{name}】:合作比例拟定院办审核已通过", "", "SMS_112465489"),
    Msg_760("合作比例拟定院办审核不通过","项目【{name}】:合作比例拟定院办审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_770("方案初稿已上传","项目【{name}】:方案初稿已上传，请审核", "", "SMS_113210112"),
    Msg_780("方案初稿审核已通过","项目【{name}】:方案初稿审核已通过", "", "SMS_112465489"),
    Msg_790("方案初稿审核不通过","项目【{name}】:方案初稿审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_800("方案成果已上传","项目【{name}】:方案成果已上传，请上传扩初初稿", "", "SMS_112475167"),
    Msg_810("扩初初稿已上传","项目【{name}】:扩初初稿已上传，请审核", "", "SMS_113210112"),
    Msg_820("扩初初稿审核已通过","项目【{name}】:扩初初稿审核已通过", "", "SMS_112465489"),
    Msg_830("扩初初稿审核不通过","项目【{name}】:扩初初稿审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_840("扩初成果已上传","项目【{name}】:扩初成果已上传，请上传施工初稿", "", "SMS_112475167"),
    Msg_850("施工初稿已上传","项目【{name}】:施工初稿已上传，请审核", "", "SMS_113210112"),
    Msg_860("施工初稿审核已通过","项目【{name}】:施工初稿审核已通过", "", "SMS_112465489"),
    Msg_870("施工初稿审核不通过","项目【{name}】:施工初稿审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_880("规划初稿已上传","项目【{name}】:规划初稿已上传，请审核", "", "SMS_113210112"),
    Msg_890("规划初稿审核已通过","项目【{name}】:规划初稿审核已通过", "", "SMS_112465489"),
    Msg_900("规划初稿审核不通过","项目【{name}】:规划初稿审核不通过，理由:{reason}", "", "SMS_112470383"),
    Msg_910("开发票已申请","项目【{name}】:开发票已申请，请审核", "", "SMS_112465373"),
    Msg_920("开发票已申请","项目【{name}】:开发票已申请，请关注", "", "SMS_112780126"),
    Msg_930("开发票已申请","项目【{name}】:开发票已申请，请关注", "", "SMS_112780126"),
    Msg_940("项目修改已申请","项目【{name}】:项目修改已申请，请审核", "", "SMS_112465373"),
    Msg_950("合同修改已申请","项目【{name}】:合同修改已申请，请审核", "", "SMS_112465373"),
    Msg_960("申请开票财务审核已通过","项目【{name}】:申请开票财务审核已通过", "", "SMS_112465489"),
    Msg_970("申请开票财务审核不通过","项目【{name}】:申请开票财务审核不通过，理由:{reason}", "", "SMS_112470383"),
    // ("{出纳确认类型}已完成","项目【{项目名字}】:{出纳确认类型}已完成，金额:{MM}","")
    Msg_980("{confirmType}已完成","项目【{name}】:{confirmType}已完成，金额:{money}万元", "", "SMS_112465155"),
    Msg_990("项目支出已申请","项目【{name}】:项目支出已申请，请审核", "", "SMS_112465373"),
    Msg_1000("发票财务审核已通过","项目【{name}】:发票财务审核已通过", "", "SMS_112465489"),
    Msg_1010("发票财务审核不通过","项目【{name}】:发票财务审核不通过，理由:{reason}", "", "SMS_112470383"),
    userRegisterCode("用户注册验证码","验证码【{code}】，您正在注册成为新用户，感谢您的支持！", "", "SMS_109700179"),
    findPassword("找回密码验证码","验证码【{code}】，您正在尝试修改登录密码，请妥善保管账户信息。", "", "SMS_109700178"),
    uploadSharedFile("共享文件上传","{name}上传了共享文件({file})", "", "SMS_117521916"),
    contractExpire("合同到期","以下员工({name})的合同即将于【{date}】结束，请注意", "", "SMS_117517005"),
    practiceExpire("实习期到期","以下实习生({name})的实习期即将于【{date}】结束，请注意", "", "SMS_117521878"),
    probationExpire("试用期到期","以下员工({name})的试用期即将于【{date}】结束，请注意", "", "SMS_117521876"),
    birthdayInform("生日提醒","{month}月生日员工名单:{name}，请了解", "", "SMS_117512869"),
    interview_invitation("面试邀请", "请您参加本公司以下活动：{some}，时间：{time}，地点：{place}", "", "SMS_120130308"),
    interview_remind("面试提醒", "请您主持本公司以下活动：{some}，时间：{time}，地点：{place}", "", "SMS_122286512"),
    ;

    private String value;

    private String message;

    /**
     * 跳转地址
     */
    private String address;
    
    /**
     * 模板code
     */
    private String templateCode;

    private NotifyContextEnum(String value, String message, String address, String templateCode) {
        this.value = value;
        this.message = message;
        this.address = address;
        this.templateCode = templateCode;
    }

    public String getValue() {
        return value;
    }

    public String getMessage() {
        return message;
    }

    public String getAddress() {
        return address;
    }

    public String getTemplateCode() {
        return templateCode;
    }

    public static NotifyContextEnum getByValue(Integer value) {
        if (value != null) {
            for (NotifyContextEnum enu : values()) {
                if (enu.value.equals(value)) {
                    return enu;
                }
            }
        }
        return null;
    }
    
    public static NotifyContextEnum getByCode(String code) {
        if (code != null) {
            for (NotifyContextEnum enu : values()) {
                if (enu.templateCode.equals(code)) {
                    return enu;
                }
            }
        }
        return null;
    }
}
